# Напишіть програму, яка запитує у користувача натуральне десяткове число і
# виводить його двійкове уявлення. Реалізуйте алгоритм переведення числа в
# двійкову систему числення, використовуючи основні концепції подання чисел
# (підказка: через розподіл із залишком). Виведіть отримане подання числа на екран.
#
# Приклад:
# Введіть натуральне десяткове число: 123
# Двійкове уявлення числа: 1111011

n = int(input("Введіть натуральне десяткове число: "))

if n <= 0:
    print("Число має бути натуральним (більшим за 0).")
else:
    binary = ""

    while n > 0:
        remainder = n % 2
        binary = str(remainder) + binary
        n = n // 2

    print(f"Двійкове уявлення числа: {binary}")
