# Напишіть програму, яка запитує користувача три числа і виводить їх у порядку
# зростання, розділені комою. Використовуйте умовні оператори та вкладені
# умови для вирішення завдання. Передбачається, що це три числа різні.

# Приклад:
# Введіть перше число: 5
# Введіть друге число: 2
# Введіть третє число: 7

a = int(input("Введіть перше число: "))
b = int(input("Введіть друге число: "))
c = int(input("Введіть третє число: "))

if a < b:
    if b < c:
        print(f"Числа в порядку зростання: {a}, {b}, {c}")
    elif a < c:
        print(f"Числа в порядку зростання: {a}, {c}, {b}")
    else:
        print(f"Числа в порядку зростання: {c}, {a}, {b}")
else:
    if a < c:
        print(f"Числа в порядку зростання: {b}, {a}, {c}")
    elif b < c:
        print(f"Числа в порядку зростання: {b}, {c}, {a}")
    else:
        print(f"Числа в порядку зростання: {c}, {b}, {a}")
