# Напишіть програму, яка приймає список чисел і повертає суму, мінімальне та
# максимальне значення зі списку. Використовуйте функцію для обробки списку
# чисел та повернення трьох значень. Виведіть результат на eкран за допомогою
# команди print.
#
# Приклад:
# Введіть числа через кому та пробіл: 3, 7, 2, 9, 1, 5
# Сума чисел: 27
# Мінімальне значення: 1
# Максимальне значення: 9


def get_info(user_str_list):
    user_list = [int(item) for item in user_str_list]
    return sum(user_list), min(user_list), max(user_list)


user_input = input("Введіть числа через кому та пробіл: ").split(", ")
try:
    s, mn, mx = get_info(user_input)
    print(f"Сума чисел: {s}")
    print(f"Мінімальне значення: {mn}")
    print(f"Максимальне значення: {mx}")
except ValueError:
    print("Помилка: потрібно вводити тільки числа, розділені комами.")
