# Напишіть генератор, який генеруватиме нескінченну послідовність Фібоначчі.
# Щоразу, коли генератор викликається, він повинен повертати таку кількість
# послідовності. Напишіть програму, яка використовуватиме цей генератор для
# виведення перших N чисел Фібоначчі.
# Приклад висновку:
# Введіть кількість чисел Фібоначчі: 10
# Перші 10 чисел Фібоначчі:
# 0
# 1
# 1
# 2
# 3
# 5
# 8
# 13
# 21
# 34


def print_fibo():
    first_n = 0
    next_n = 1
    while True:
        yield first_n
        first_n, next_n = next_n, first_n + next_n


n = int(input("Введіть кількість чисел Фібоначчі:"))
fibo_gen = print_fibo()
print(f"Перші {n} чисел Фібоначчі:")
for _ in range(n):
    print(next(fibo_gen))
