# Дано натуральне число N. Написати функцію power_of_2(N), яка друкує
# слово YES, якщо число N є точним ступенем двійки, або слово NO в
# інакше. Користуємося рекурсією, а операцією зведення на ступінь не
# користуємося.
#
# Приклад:
# power_of_2(8) поверне YES
# power_of_2(3) поверне NO.

# Чи є задане натуральне число N ступенем числа 2 — тобто,
# чи існує таке ціле k ≥ 0, що 2^k = N.

# Очікувана поведінка функції:
# має надрукувати YES, якщо число N — це 1, 2, 4, 8, 16, 32, 64, 128 тощо;
# має надрукувати NO, якщо N — не ступінь двійки (наприклад, 3, 6, 10, 18...).


def power_of_2(n):
    if n == 1:
        return "YES"
    if n % 2 == 0 or n == 0:
        return power_of_2(n // 2)
    return "NO"


print(power_of_2(8))
print(power_of_2(3))
