# Напишіть програму, яка приймає число з плаваючою точкою і округляє його до
# цілого числа відповідно до правил шкільної математики. Використовувати
# модуль math та методи з нього не можна. Врахувати, що програма має коректно
# працювати з негативними числами.
#
# Приклад:
# Введіть дійсне число: -3.14
# Округлене значення: -3
# Введіть дійсне число: 4.5
# Округлене значення: 5
# Введіть дійсне число: 5.5
# Округлене значення: 6

num = float(input("Введіть дійсне число: "))
integer_part = int(num)
fraction_part = abs(num - integer_part)

if fraction_part >= 0.5:
    if num > 0:
        result = integer_part + 1
    else:
        result = integer_part - 1
else:
    result = integer_part

print(f"Округлене значення: {result}")
