# Напишіть програму, яка запитує у користувача ціле число і визначає, чи є
# воно паліндромом. Число є паліндромом, якщо воно читається однаково зліва
# направо і праворуч наліво. Виведіть відповідне повідомлення на екран за
# допомогою команди print. Використовуйте математичні операції.
# Роботу з рядками використовувати не можна.
#
# Приклад:
# Введіть ціле число: 12321
# Число є паліндромом.
# Введіть ціле число: 12323
# Число не є паліндромом.

number = int(input("Введіть ціле число: "))

original = number
reversed_number = 0

temp = number

while temp > 0:
    digit = temp % 10
    reversed_number = reversed_number * 10 + digit
    temp = temp // 10

if original == reversed_number:
    print("Це паліндром.")
else:
    print("Це не паліндром.")
