# Напишіть програму, яка запитує у користувача ціле число і перевіряє, чи
# є воно числом Армстронга. Число Армстронга - це число, яке дорівнює сумі
# своїх цифр, зведених у ступінь, що дорівнює кількості цифр у числі.
# Виведіть відповідне повідомлення на екран за допомогою команди # print.
#
# Приклад:
# Введіть ціле число: 153 (це без виводу на екран: 153 = 1**3 + 5**3 + 3**3)
# Число є числом Армстронга.

number = int(input("Введіть ціле число: "))
original = number

num_digits = 0
temp = number
while temp > 0:
    temp //= 10
    num_digits += 1

sum_of_powers = 0
temp = number
while temp > 0:
    digit = temp % 10
    sum_of_powers += digit**num_digits
    temp //= 10

if number == sum_of_powers:
    print("Це число Армстронга.")
else:
    print("Це не число Армстронга.")
