# Давайте створимо простий калькулятор. Напишіть програму, яка запитує у
# користувача два цілих числа і виконує такі дії:
# - обчислює суму та виводить результат.
# - обчислює різницю і виводить результат (перше число мінус друге число).
# - обчислює добуток та виводить результат.
# - обчислює ділення (результат поділу першого числа на друге) та виводить
#   результат.
# - обчислює залишок від поділу першого числа на друге та виводить результат.
# - Зводить перше число у ступінь другого числа та виводить результат.

# Приклад:
# Введіть перше число: 5
# Введіть друге число: 2

# Сума: 7
# Різниця: 3
# Добуток: 10
# Ділення: 2.5
# Залишок від ділення: 1
# Перше число у ступені другого числа: 25

a = int(input("Введіть перше число: "))
b = int(input("Введіть друге число: "))

print(f"Сума: {a + b}")
print(f"Різниця: {a - b}")
print(f"Добуток: {a * b}")

if b != 0:
    print(f"Ділення: {a / b}")
    print(f"Залишок від ділення: {a % b}")
else:
    print("Ділення та залишок від ділення неможливі (ділення на нуль).")

print(f"Перше число у ступені другого числа: {a ** b}")
