# Напишіть програму, яка приймає список чисел від користувача та сортує
# його в порядку зменшення, використовуючи метод sort() і параметр
# reverse = True. Виведіть відсортований список на екрані.
#
# Приклад:
# Введіть список чисел, розділених пробілами: 5 2 8 1 3
# Відсортований список чисел: [8, 5, 3, 2, 1]

user_input = input("Введіть список чисел, розділених пробілами:").split(" ")
user_input = [int(n) for n in user_input]
user_input.sort(reverse=True)
print("Відсортований список чисел:", user_input)
