# Напишіть програму, яка використовує рекурсію для обчислення суми цифр
# Числа. Створіть функцію sum_digits, яка приймає один аргумент – число,
# для якого потрібно обчислити суму цифр. Використовуйте умову виходу з
# рекурсії, коли число складається з однієї цифри. Виведіть результат на екран.
#
# Приклад:
# Введіть число: 12345
# Сума цифр числа 12345 дорівнює 15


def sum_digits(input_number):
    if input_number < 10:
        return input_number
    return input_number % 10 + sum_digits(input_number // 10)


user_input = int(input("Введіть число: "))
res = sum_digits(user_input)
print(res)
